// ============================================================
// AMBIENTE
// ============================================================

// var ambiente_processo = "producao";
var ambiente_processo = "desenvolvimento";

var caminho_env =
    ambiente_processo === "producao"
        ? ".env"
        : ".env.dev";

require("dotenv").config({
    path: caminho_env
});

// ============================================================
// DEPENDÊNCIAS
// ============================================================

var express = require("express");
var cors = require("cors");
var path = require("path");

// ============================================================
// ROUTES
// ============================================================

var indexRouter = require("./src/routes/index");
var usuarioRouter = require("./src/routes/usuarios");
var avisosRouter = require("./src/routes/avisos");
var empresasRouter = require("./src/routes/empresas");
var dashboardRouter = require("./src/routes/dashboard");

// ============================================================
// CONFIG APP
// ============================================================

var app = express();

var PORTA_APP = process.env.APP_PORT;
var HOST_APP = process.env.APP_HOST;

// ============================================================
// MIDDLEWARES
// ============================================================

app.use(cors());

app.use(express.json());

app.use(express.urlencoded({
    extended: false
}));

app.use(
    express.static(
        path.join(__dirname, "public")
    )
);

// ============================================================
// ROTAS
// ============================================================

app.use("/", indexRouter);

app.use("/usuarios", usuarioRouter);

app.use("/avisos", avisosRouter);

app.use("/empresas", empresasRouter);

app.use("/dashboard", dashboardRouter);

// ============================================================
// LOG AMBIENTE
// ============================================================

console.log(`
============================================================

AMBIENTE: ${process.env.AMBIENTE_PROCESSO}

HOST: ${HOST_APP}

PORTA: ${PORTA_APP}

BANCO: ${process.env.DB_DATABASE}

USUÁRIO: ${process.env.DB_USER}

============================================================
`);

// ============================================================
// START SERVER
// ============================================================

app.listen(PORTA_APP, function () {

    console.log(`
    
███╗   ██╗███████╗██╗    ██╗██████╗  ██████╗  █████╗ ██████╗
████╗  ██║██╔════╝██║    ██║██╔══██╗██╔═══██╗██╔══██╗██╔══██╗
██╔██╗ ██║█████╗  ██║ █╗ ██║██████╔╝██║   ██║███████║██║  ██║
██║╚██╗██║██╔══╝  ██║███╗██║██╔══██╗██║   ██║██╔══██║██║  ██║
██║ ╚████║███████╗╚███╔███╔╝██║  ██║╚██████╔╝██║  ██║██████╔╝
╚═╝  ╚═══╝╚══════╝ ╚══╝╚══╝ ╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═╝╚═════╝

Servidor online:
http://${HOST_APP}:${PORTA_APP}

Modo:
${process.env.AMBIENTE_PROCESSO}

============================================================
    `);

});